tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jimeh/emacs-builds"
tap "railwaycat/emacsmacport"
tap "v2ray/v2ray"
brew "mas"
###
mas 'Anybox', id: 1593408455
mas 'Keynote', id: 409183694
mas 'Shapr3D', id: 1091675654
mas 'Telegram', id: 747648890
mas 'Todoist', id: 585829637
mas 'GarageBand', id: 682658836
mas 'Grammarly for Safari', id: 1462114288
mas 'Amphetamine', id: 937984704
mas 'Toggl Track', id: 1291898086
mas 'LiquidText', id: 922765270
mas 'Highlights', id: 1498912833
mas 'WireGuard', id: 1451685025
mas 'Numbers', id: 409203825
mas 'Xcode', id: 497799835
mas 'Bitwarden', id: 1352778147
mas 'MarginNote 3', id: 1423522373
mas 'Notability', id: 360593530
mas 'VMware Remote Console', id: 1230249825
mas 'iMovie', id: 408981434
mas 'Pages', id: 409201541
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'Slack', id: 803453959
mas 'PomoDone App', id: 1096128050
mas 'Shortery', id: 1594183810
###
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "automake"
brew "openssl@1.1"
brew "python@3.9"
brew "chezmoi"
brew "gnutls"
brew "harfbuzz"
brew "pango"
brew "ffmpeg"
brew "gcc"
brew "gd"
brew "gdk-pixbuf"
brew "ghostscript"
brew "gnupg"
brew "python@3.11"
brew "gobject-introspection"
brew "jasper"
brew "netpbm"
brew "gts"
brew "librsvg"
brew "graphviz"
brew "guile"
brew "helm"
brew "htop"
brew "shared-mime-info"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "iperf"
brew "ipmitool"
brew "jq"
brew "krb5"
brew "ldns"
brew "libfido2"
brew "libgccjit"
brew "libssh"
brew "libssh2"
brew "libxml2"
brew "mailutils"
brew "mosh"
brew "neovim"
brew "qt@5"
brew "neovim-qt"
brew "nmap"
brew "openjdk"
brew "poppler"
brew "postgresql@14"
brew "python@3.10"
brew "qt"
brew "stunnel", restart_service: true
brew "tmux"
brew "watch"
brew "wget"
brew "zsh-completions"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-dbus", "with-imagemagick", "with-native-comp"]
cask "background-music"
cask "balenaetcher"
cask "dbeaver-community"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "mactex-no-gui"
cask "nrlquaker-winbox"
cask "rectangle"
cask "v2rayx"
cask "webtorrent"
cask "wireshark"
cask "xpra"
vscode "4ops.packer"
vscode "4ops.terraform"
vscode "alexcvzz.vscode-sqlite"
vscode "asvetliakov.vscode-neovim"
vscode "BazelBuild.vscode-bazel"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "ChadBaileyVh.oled-pure-black---vscode"
vscode "charliermarsh.ruff"
vscode "cweijan.vscode-office"
vscode "DEVSENSE.composer-php-vscode"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "EQuimper.react-native-react-redux"
vscode "esbenp.prettier-vscode"
vscode "ExodiusStudios.comment-anchors"
vscode "fabianlauer.vs-code-xml-format"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.copilot-labs"
vscode "GitHub.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "gustavoinacio.oled-neon-theme"
vscode "hashicorp.terraform"
vscode "James-Yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "jebbs.plantuml"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jithurjacob.nbpreviewer"
vscode "johnpapa.vscode-peacock"
vscode "josetr.cmake-language-support-vscode"
vscode "jroesch.lean"
vscode "KevinRose.vsc-python-indent"
vscode "leanprover.lean4"
vscode "matangover.mypy"
vscode "mathematic.vscode-latex"
vscode "mattn.Lisp"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "mechatroner.rainbow-csv"
vscode "mindaro-dev.file-downloader"
vscode "mindaro.mindaro"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-pyright.pyright"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "mshr-h.veriloghdl"
vscode "mutantdino.resourcemonitor"
vscode "nickfode.latex-formatter"
vscode "quarto.quarto"
vscode "qwtel.sqlite-viewer"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "rust-lang.rust-analyzer"
vscode "tamasfe.even-better-toml"
vscode "tht13.python"
vscode "tommorris.mako"
vscode "torn4dom4n.latex-support"
vscode "trunk.io"
vscode "valentjn.vscode-ltex"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "wix.glean"
vscode "XadillaX.viml"
vscode "yzhang.markdown-all-in-one"
vscode "ZainChen.json"
